tests/suite-root-url-test/75000-conc-2500/ab_report.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.0.14 (be patient)


Server Software:        WEBrick/1.3.1
Server Hostname:        10.0.0.14
Server Port:            80

Document Path:          /
Document Length:        547 bytes

Concurrency Level:      2500
Time taken for tests:   1210.690 seconds
Complete requests:      75000
Failed requests:        51394
   (Connect: 0, Receive: 0, Length: 51394, Exceptions: 0)
Non-2xx responses:      51394
Keep-Alive requests:    75000
Total transferred:      36622056 bytes
HTML transferred:       16355880 bytes
Requests per second:    61.95 [#/sec] (mean)
Time per request:       40356.340 [ms] (mean)
Time per request:       16.143 [ms] (mean, across all concurrent requests)
Transfer rate:          29.54 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4  54.2      0    1002
Processing:   213 39364 18291.1  41250  182997
Waiting:      213 39363 18291.2  41250  182997
Total:        213 39368 18289.2  41250  182997

Percentage of the requests served within a certain time (ms)
  50%  41250
  66%  45176
  75%  50244
  80%  52979
  90%  62237
  95%  63790
  98%  73722
  99%  88254
 100%  182997 (longest request)